Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.UndefinedSpaces Property
 There are undefined Spaces in the model! Recommend creating a Space schedule and checking the Area parameter of each Space for warnings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndefinedSpaces { get; }
Public Shared ReadOnly Property UndefinedSpaces As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndefinedSpaces {
	FailureDefinitionId^ get ();
}
static member UndefinedSpaces : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace